

# 페이지 36 코드 작성 
# getSymbols()함수를 이용한 API다운로드 
# 야후 파이내스에서 무료로 제공 함 


library(quantmod)

#=====================================================================
# 1) 자동적으로 객체 생성 
#=====================================================================
#자동적으롤 객체에 저장이 됨 
# 2007년 1월 부터 현재 데이터 다운로드 됨 
getSymbols('QQQ') #[1] "QQQ"
tail(QQQ)

chart_Series(Ad(QQQ)) #Ad함수는 배당이 반영된 수정주가 데이터 불러옴 


#=====================================================================
# 2) 객체 및 기간 지정  
#=====================================================================
xts_qqq <- getSymbols('QQQ', from = '2000-01-01', to = '2019-12-31', 
           auto.assign = FALSE) 
tail(xts_qqq)


#=====================================================================
# 3) 여러 티커를 한꺼번에  수행   
#=====================================================================
ticker <- c("SPY", "EMQQ")
getSymbols(ticker) #[1] "SPY"  "EMQQ"
tail(EMQQ)



#=====================================================================
# 4) 국내 상장 종목 다운로드  
# 삼성전자 : 005930 + .KS
#=====================================================================
xts_smsg <- getSymbols('005930.KS', from = '2000-01-01', to = '2019-12-31', auto.assign = FALSE) 
tail(Cl(xts_smsg)) #Cl: 종가만 선택 



#=====================================================================
# 5) 미국 연방준비은행에서 관리하는 경제지표 데이터   
# 미국채 10년물 금리 : DGS10
#=====================================================================
getSymbols('DGS10', src = 'FRED') 
tail(DGS10)
chart_Series(DGS10)



#=====================================================================
# 6) 미국 연방준비은행에서 관리하는 경제지표 데이터   
# 환율 : DEXKOUS
#=====================================================================
getSymbols('DEXKOUS', src = 'FRED') 
tail(DEXKOUS)
chart_Series(DEXKOUS)





